In [2]:
import pandas as pd
titan_df = pd.read_csv('./train.csv')
titan_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
# Extract Column Names
print(titan_df.columns, len(titan_df.columns))

# Extract Index Object
indexes = titan_df.index
print(indexes)

# Index 객체를 array로 변환
index_array = indexes.values

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object') 12
RangeIndex(start=0, stop=891, step=1)

In [24]:
## index의 특징
print(type(index_array))
print(index_array.shape)
print(index_array[:4])
print(index_array[5])

# index의 값은 바꿀 수 없다

<class 'numpy.ndarray'>
(891,)
[0 1 2 3]
5

In [26]:
titan_df[['Name','Age']]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

Series 객체는 Index 객체를 포함하지만, Series 객체에 연산 시에 Index는 연산에서 제외된다. 오직 Index는 식별용

In [27]:
titan_df['Pclass']
titan_df['Pclass'].value_counts()

# dataframe
titan_df[['Sex','Pclass']].value_counts()

Sex     Pclass
male    3         347
female  3         144
male    1         122
        2         108
female  1          94
        2          76
dtype: int64

In [31]:
# 60세 이상인 여승객만 호출
titan_df_f = titan_df[(titan_df['Sex']=='female')&(titan_df['Age']>60)]
titan_df_f.reset_index(drop=True, inplace=True)
#titan_df_f.drop('index', axis=1)

# reset_index - 2번째 방법
#titan_df_f.reset_index(drop=True)

In [32]:
titan_df_f

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
1,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
2,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

In [35]:
### iloc와 loc를 설명해보자
print(titan_df['Pclass'].head(3))
print(titan_df[['Pclass', 'Age']].head(3))
# titan_df[0] # [] 안에 숫자를 넣으면 Key error 발생

titan_df[0:2] # slicing은 된다?!

0    3
1    1
2    3
Name: Pclass, dtype: int64
   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [43]:
## 위의 cell에서 생성되는 문제를 해결하기 위해 loc와 ioc를 학습해봅니다.

data = {'Name':['Jung-ho','Yong-hyun','Se-a'],
        'Year':[2017,2012,2015],
        'Gender':['Male','Male','Female']}

data_df = pd.DataFrame(data,index=[1,2,3])
data_df

        Name  Year  Gender
1    Jung-ho  2017    Male
2  Yong-hyun  2012    Male
3       Se-a  2015  Female